{
  "model_type": "hrm_text",
  "architectures": [
    "HrmTextForCausalLM"
  ],
  "vocab_size": 65536,
  "hidden_size": 1536,
  "intermediate_size": 4096,
  "num_hidden_layers": 16,
  "num_attention_heads": 12,
  "num_key_value_heads": 12,
  "head_dim": 128,
  "H_cycles": 2,
  "L_cycles": 3,
  "L_bp_cycles": [
    0,
    3
  ],
  "max_position_embeddings": 4096,
  "rms_norm_eps": 1e-06,
  "rope_theta": 10000.0,
  "tie_word_embeddings": false,
  "initializer_range": 0.025515518153991442,
  "embedding_scale": 39.191835884530846,
  "prefix_lm": true,
  "pad_token_id": 5,
  "bos_token_id": 6,
  "eos_token_id": 11
}