{
  "add_prefix_space": null,
  "backend": "tokenizers",
  "bos_token": "<|im_start|>",
  "eos_token": "<|box_end|>",
  "is_local": true,
  "local_files_only": false,
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": "<|endoftext|>",
  "tokenizer_class": "Qwen2Tokenizer",
  "unk_token": "<|endoftext|>"
}
